<template>
  <div>
    <main class="container">
      <div class="row">
        <div class="col-md-12 alert alert-light shadow-lg">
          <div class="border-bottom border-gray">
            <h2>Биржа фриланса</h2>Лучшие фрилансеры выполнят ваш заказ
            <div class="row mt-3">
              <div class="col-md-7">
                <div class="input-group mb-3 shadow">
                  <input
                    type="text"
                    class="form-control"
                    placeholder="Что нужно сделать?"
                    aria-label="Что нужно сделать?"
                    aria-describedby="basic-addon1"
                    v-model="message"
                  />
                  <div class="input-group-prepend">
                    <button @click="goPage('addTask')" class="btn btn-warning">Создать заказ</button>
                  </div>
                </div>
              </div>
            </div>Например:
            <a @click="makeSite()" href="#">создать сайт</a> или
            <a @click="makeDB()" href="#">разработать базу данных</a>
            <br />
            <div class="row">
              <div class="col-md-3">
                <div class="row">
                  <div class="col-md-4">
                    <img
                      class="life_cycle_task"
                      :src="$store.getters.get_url_media + '/Media/FL/1.png'"
                    />
                  </div>
                  <div class="col-md-8">
                    <i class="material-icons" style="padding: 0px">looks_one</i>
                    <b>Заказчик</b>
                    <br />размещает свой заказ за пару минут
                  </div>
                </div>
              </div>

              <div class="col-md-3">
                <div class="row">
                  <div class="col-md-4">
                    <img
                      class="life_cycle_task"
                      :src="$store.getters.get_url_media + '/Media/FL/2.png'"
                    />
                  </div>
                  <div class="col-md-8">
                    <i class="material-icons icon_number">looks_two</i>
                    <b>Фрилансеры</b>
                    <br />предлагают услуги, цены и сроки
                  </div>
                </div>
              </div>

              <div class="col-md-3">
                <div class="row">
                  <div class="col-md-4">
                    <img
                      class="life_cycle_task"
                      :src="$store.getters.get_url_media + '/Media/FL/3(1).png'"
                    />
                  </div>
                  <div class="col-md-8">
                    <i class="material-icons icon_number">looks_3</i>
                    <b>Заказчик</b>
                    <br />выбирает подходящего исполнителя
                  </div>
                </div>
              </div>

              <div class="col-md-3">
                <div class="row">
                  <div class="col-md-4">
                    <img
                      class="life_cycle_task"
                      :src="$store.getters.get_url_media + '/Media/FL/4(4).jpg'"
                    />
                  </div>
                  <div class="col-md-8">
                    <i class="material-icons icon_number">looks_4</i>
                    <b>Исполнитель</b>
                    <br />выполняет работу и получает работу
                  </div>
                </div>
              </div>
            </div>
          </div>
          <br />
          <h2>Биржа фриланса — просто и надежно!</h2>
          <p>
            Биржа фриланса — это онлайн платформа, представляющая собой удобный способ взаимодействия между работодателем и специалистом.
            Данный формат сотрудничества не требует личной встречи, а обговаривать все детали проекта и оплачивать проделанный труд просто даже тогда,
            когда стороны находятся в разных уголках планеты.
            <br/>
            Фрилансер (англ. freelancer) - свободный работник. Когда-то таким словом именовали вольных наемников в военном деле. Современный freelancer -
            это профессионал, который освободился от офисного гнёта и начал трудиться дома или в коворкинге. Причем без обязательного официального образования.
            Главное - в совершенстве владеть навыками, необходимыми для реализации конкретной задачи.
          </p>
          <h2>Для чего нужна биржа фриланса?</h2>
          <p>
            Для того чтобы соискатели могли предлагать свои услуги, а заказчики находить исполнителей, и существуют специальные веб-сервисы.
            <br/>На FL собран большой каталог вакансий и портфолио удаленщиков из Украины, России и других стран. Работодатели могут разместить
            вакансии или конкретный проект и выбрать того, кто займется решением поставленной задачи. Работа на фриланс биржах для специалистов -
            это возможность находить для себя как разовую подработку, так и с долгосрочной перспективой.
            <br/>На фриланс-сайтах ежедневно публикуется множество предложений о поиске умельцев. Выполняя изначально небольшие и не очень высокооплачиваемые заказы,
            можно со временем наработать базу клиентов и иметь постоянную загрузку, отказываясь от мелких и неинтересных заданий.
          </p>
          <h2>Биржа фриланса: отзывы, рейтинг и другие преимущества</h2>
          <p>
            Биржи заданий фриланс услуг являются идеальным местом для встречи с потенциальными работодателями. Особенно для новичков, не успевших наработать
            клиентскую базу. Для специалистов, начинающих путь на удаленном поприще, наша платформа - это весьма ценный ресурс для профессионального развития без вложений.
            <br/>
            На сайте публикуется огромное количество проектов по разным направлениям, что открывает широкие возможности для получения заработка.
            Одно из главных преимуществ деятельности на бирже - финансовая безопасность. Оформляя сотрудничество в рамках Безопасной сделки, каждая из сторон получает
            гарантии выполнения задания и оплаты за него. Вывод денег с сервиса происходит максимально быстро и без особых трудностей. Поддерживаются самые популярные
            платежные системы.
            <br/>
            Кроме того, благодаря рейтингам, легко оценить профессионализм исполнителей, изучив их портфолио, трудовой опыт и наличие рекомендаций. Удаленные соискатели,
            в свою очередь, могут познакомиться с репутацией работодателя и определить, стоит ли ему доверять.
            <br/>
            Важный момент для любого веб-ресурса - техническая поддержка. На Веблансер она моментально реагирует на обращения пользователей, оперативно решая возникшие
            трудности или консультируя по вопросам функционирования портала.
            <br/>
            Еще один бонус для фрилансеров - форум, на котором всегда можно найти поддержку более опытных коллег. Также полезную информацию об удаленном труде можно
            обнаружить в блоге, который регулярно наполняется новыми статьями.
          </p>
          <h2>Сравнительная таблица выгод и преимуществ</h2>
          <table class="shadow-lg">
            <tr>
              <th></th>
              <th>На фриланс-бирже</th>
              <th>Вне биржи</th>
            </tr>
            <tr style="padding: 3px">
              <td>Поиск заказов</td>
              <td>Заказы и вакансии на одном сайте сгруппированы по темам</td>
              <td>По объявлениям в интернете, посредством холодных звонков</td>
            </tr>
            <tr>
              <td>Оплата труда</td>
              <td>Гарантированная оплата при использовании безопасной сделки. Возможность удостовериться в надежности заказчика благодаря отзывам</td>
              <td>Работая без предоплаты, есть риск столкнуться с недобросовестными нанимателями</td>
            </tr>
            <tr>
              <td>Повышение репутации</td>
              <td>С количеством успешно выполненных заданий и числом хороших отзывов растет рейтинг фрилансера</td>
              <td>Каждый раз приходится доказывать свою профпригодность новым клиентам, выполнять тестовые задания</td>
            </tr>
            <tr>
              <td>Аналитика</td>
              <td>В профиле исполнителя сохраняется история заказов и оплат, а также деловая переписка</td>
              <td>Нужно самостоятельно вести учет заказов, на что не всегда хватает времени</td>
            </tr>
          </table>
          <br/>
          <h2>Есть ли недостатки работы через фриланс сервис?</h2>
          <p>Есть, но они возникают только в том случае, если фрилансер малоинициативен и недисциплинирован. Самый явный недостаток - нестабильность заработка. 
            Он возникает, как правило, на старте удаленной карьеры, когда получать заказы сложно ввиду отсутствия рейтинга. В остальных случаях его можно избежать, 
            если правильно распределять финансы и профессионально выполнять задания.
          <br/>
          Другой важный момент - отсутствие социального пакета. Но это, скорее, проблема всего freelance, а не конкретно биржи фриланса для удаленной работы. 
          Решить ее можно регистрацией частного или индивидуального предпринимателя.</p>
          <h2>Биржа фриланс услуг для заказчиков</h2>
          <p>Заказчик может поискать профессионалов, готовых к сотрудничеству, просмотреть их профили, портфолио и отзывы, которые оставили предыдущие работодатели. 
            Также может разместить свой проект или фриланс-вакансию. Как правило, услуги профи с богатым портфолио и большим количеством положительных отзывов, стоят в 
            разы дороже, чем у новичков. Однако это вовсе не говорит о плохой компетенции последних. Новые зарегистрированные исполнители в виду отсутствия богатого портфолио 
            и комментариев, вынуждены ставить низкую цену, чтобы привлечь клиентов. Это значит, что, делая заказ у них, можно значительно сэкономить. Чтобы не рисковать 
            и не поручать крупный проект непроверенному человеку, лучше сформировать небольшой заказ, и, если качество работы фрилансера устроит, продолжить сотрудничество.</p>
        </div>
      </div>
    </main>
  </div>
</template>
<script>
export default {
  data() {
    return {
      message: ""
    };
  },
  methods: {
    makeSite() {
      this.message = "Создать сайт";
    },
    makeDB() {
      this.message = "Разработать базу данных";
    },
    goPage(item){
      sessionStorage.setItem("title", this.message);
      this.$router.push({ name: item });
    },
  }
};
</script>
<style>

.icon_number {
  padding: 0px;
  color: gray;
}

.life_cycle_task {
  height: 90px;
  width: 90px;
}

th {
  padding: 10px; 
  border: 1px solid #b38a22;
}

td {
  font-size: 0.8em;
  padding: 5px 7px;
  border: 1px solid #b38a22;
}
</style>